In [1]:
print("hello world")

hello world

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
import matplotlib.pyplot as plt

In [5]:
brands = pd.read_csv(r"brands.csv")

In [9]:
brands

           pid    BRAND
0        66605  BRAND_0
1        66715  BRAND_0
2        66756  BRAND_0
3        66774  BRAND_0
4        66794  BRAND_0
...        ...      ...
263248  241084  BRAND_9
263249  242220  BRAND_9
263250  248306  BRAND_9
263251  251575  BRAND_9
263252  254937  BRAND_9

[263253 rows x 2 columns]

In [10]:
sim = pd.read_csv(r"sim.csv")

In [11]:
sim

           pid     SIM
0        63422  SIM_14
1        63423  SIM_14
2        63424  SIM_14
3        63425  SIM_14
4        63427  SIM_36
...        ...     ...
102817  176008  SIM_14
102818  176009  SIM_14
102819  176010  SIM_14
102820  176011  SIM_14
102821  176013  SIM_14

[102822 rows x 2 columns]

In [12]:
tariffs = pd.read_csv(r"tariffs.csv")

In [13]:
tariffs

           pid            TARIFF
0        63422  TARIFF_OPTION_87
1        63423  TARIFF_OPTION_87
2        63424  TARIFF_OPTION_88
3        63425  TARIFF_OPTION_87
4        63426  TARIFF_OPTION_87
...        ...               ...
136942  176009  TARIFF_OPTION_87
136943  176010  TARIFF_OPTION_87
136944  176011  TARIFF_OPTION_87
136945  176012  TARIFF_OPTION_87
136946  176013  TARIFF_OPTION_87

[136947 rows x 2 columns]

In [14]:
channels = pd.read_csv(r"channels.csv")

In [15]:
channels

           pid     CHANNEL
0           61  Onlineshop
1          142  Onlineshop
2          194  Onlineshop
3          247  Onlineshop
4          250  Onlineshop
...        ...         ...
221897  241084   Telesales
221898  242220  Onlineshop
221899  248306  Onlineshop
221900  251575   Telesales
221901  254937  Onlineshop

[221902 rows x 2 columns]

In [16]:
d0 = pd.read_csv(r"hda_dataset_uniform_random_0.csv")

In [17]:
d1 = pd.read_csv(r"hda_dataset_uniform_random_1.csv")

In [18]:
d2 = pd.read_csv(r"hda_dataset_uniform_random_2.csv")

In [19]:
d3 = pd.read_csv(r"hda_dataset_uniform_random_3.csv")

In [20]:
d4 = pd.read_csv(r"hda_dataset_uniform_random_4.csv")

In [21]:
d5 = pd.read_csv(r"hda_dataset_uniform_random_5.csv")

In [22]:
d6 = pd.read_csv(r"hda_dataset_uniform_random_6.csv")

In [23]:
d7 = pd.read_csv(r"hda_dataset_uniform_random_7.csv")

In [24]:
d0
d1
d2
d3
d4
d5
d6

          case                     event                   ts
0           15   Export from online shop  2018-09-02 00:09:03
1           15            Order imported  2018-09-02 00:22:32
2           15             Order checked  2018-09-02 00:23:04
3           15           Device hand-out  2018-09-02 00:25:50
4           15         Delivery approved  2018-09-02 00:25:50
...        ...                       ...                  ...
226806  263218  Documents complete (ERP)  2018-12-03 11:25:01
226807  263218          Goods in arrears  2018-12-03 11:27:18
226808  263218          Ready to deliver  2018-12-05 15:56:22
226809  263218                 Delivered  2018-12-06 09:49:28
226810  263218           IMEI correction  2018-12-06 09:51:55

[226811 rows x 3 columns]

In [25]:
d0.case

0              2
1              2
2              2
3              2
4              2
           ...
226394    263244
226395    263244
226396    263244
226397    263244
226398    263244
Name: case, Length: 226399, dtype: int64

In [26]:
d0.ts

0         2018-09-02 00:02:33
1         2018-09-02 00:02:46
2         2018-09-03 14:26:03
3         2018-09-03 14:27:56
4         2018-09-03 14:27:56
                 ...
226394    2018-12-03 11:26:21
226395    2018-12-03 11:28:59
226396    2018-12-05 15:23:11
226397    2018-12-05 19:06:27
226398    2018-12-05 19:19:30
Name: ts, Length: 226399, dtype: object

In [ ]:
plt.plot (d0.ts, d0.case, 'o')
plt.title("Dataset")
plt.xlabel("ts")
plt.ylabel("case")
plt.show